-- code 테이블 초기 데이터. 데이터 정책에 따름.
INSERT INTO code (code_no, code_name) VALUES
-- 직책(position)
('PS001', '팀장'),
('PS002', '부서장'),
('PS000', '직책없음'),
-- 직위(rank)
('RK001', '사원'),
('RK002', '대리'),
('RK003', '과장'),
('RK004', '차장'),
('RK005', '부장'),
('RK006', '이사'),
('RK007', '사장'),
-- 부서(department)
('DP001', 'IT 사업부'),
('DP002', 'IOT사업부'),
('DP003', '경영기획부'),
('DP004', '인사총무지원부'),
-- 팀(team)
('TM001', 'IT영업팀'),
('TM002', '해외영업팀'),
('TM003', 'IT개발팀'),
('TM004', '개발지원팀'),
('TM005', 'IOT영업팀'),
('TM006', 'IOTPass영업팀'),
('TM007', 'IOT개발팀'),
('TM008', '경영지원팀'),
('TM009', '외주관리팀'),
('TM010', '인사팀'),
('TM011', '총무팀');


